[
    {
        "id": 1,
        "title": "Адаптив без боли: как сделать резиновую вёрстку с заботой обо всех разрешениях",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/27f/32c/bd5/27f32cbd524bd662ce5b01d4f7380eb3.png",
        "body": "Все верстальщики рано или поздно сталкивались с болью, которая заключается в адаптиве  сайта под различные устройства. Существуют разные технологии, упрощающие подгонку размеров под определённые устройства, например, clamp(). Эта функция удобна, так как позволяет минимизировать использование брейкпоинтов, но у неё есть свои недостатки:",
        "link": "https://habr.com/ru/articles/819565/"
    },
    {
        "id": 2,
        "title": "ML в OCR: зачем и как",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/00f/902/a1b/00f902a1b6de833274b3535b216a1144.png",
        "body": "Привет, меня зовут Георгий Гончаров, я инженер‑консультант OCR‑платформы SOICA, предназначенной для распознавания и обработки текстовых и графических данных. Поскольку это собственная разработка, то мы постоянно внедряем новые фичи. Недавно появилась еще одна — мы назвали ее ML‑локатор. В статье расскажу, почему и как мы реализовали эту функциональность и каких результатов удалось достичь.",
        "link": "https://habr.com/ru/companies/slsoft/articles/819391/"
    },
    {
        "id": 3,
        "title": "Пример использования Workerman и Symfony Messenger",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/6bc/4ef/c7f/6bc4efc7f3e2b25df86d3697c306ccbe.png",
        "body": "Недавно мной был создан самодостаточный пример совместной работы компонентов Symfony Messenger и Symfony Console, подробно описанный в статье https://habr.com/ru/articles/817425/.Для демонстрации работы этого примера нужно вручную запустить несколько консолей (терминалов), а потом в каждой вручную запустить Worker.Мой внутренний перфекционист :-) сильно против этого возражал и говорил «а вот бы все эти консоли-терминалы запускались одной командой, в нужном количестве, сразу с Worker’ами, а если какой Worker упадёт, то заново запускались в нужном количестве».Возражать своему внутреннему перфекционисту я не стал и создал ещё один пример работы Symfony Messenger, который запускается Worker’ами из PHP фреймворка Workerman. При этом  Symfony Console вообще не используется.",
        "link": "https://habr.com/ru/articles/819187/"
    },
    {
        "id": 4,
        "title": "Усиленные пароли или 2FA",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/151/082/c55/151082c55272cbff2f649ccdb39e0429.jpg",
        "body": "Двухфакторная аутентификация (2FA) и усиленная парольная политика - два разных подхода к повышению безопасности учетных записей. Оба метода направлены на защиту от несанкционированного доступа, но они существенно различаются в реализации и уровне обеспечиваемой защиты. Давайте разберем каждый вариант подробнее, что бы понять, какой из них выбрать.",
        "link": "https://habr.com/ru/articles/818987/"
    },
    {
        "id": 5,
        "title": "Не только ORM (NoORM)",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/cc1/e85/bba/cc1e85bba66235a416d82b8122ed15f9.jpg",
        "body": "Привет, Хабр! Хочу поделиться самодельной питонской библиотекой, существенно упрощающей взаимодествие с базами данных.«Написать свой собственный ORM» – неплохая задачка для тех, кто решил поглубже изучить некоторые языковые особенности Питона, но в данном случае задача была другая – написать не ORM, а не-ORM. Механизм, упорядочивающий и облегчающий доступ к базам данных, но который сам по себе ни в коей мере не является ORM-ом.",
        "link": "https://habr.com/ru/articles/818761/"
    },
    {
        "id": 6,
        "title": "Обзор курса Certified Penetration Testing Specialist (CPTS) от HTB Academy",
        "image_link": "https://habrastorage.org/getpro/habr/upload_files/0d6/410/e2e/0d6410e2ee865a5508f713d8383f4e13.PNG",
        "body": "Приветствую, в этой статье я расскажу о курсе и итоговом экзамене HTB CPTS. Надеюсь, что это даст понимание всем, кто собирается проходить курс и сдавать экзамен в будущем.",
        "link": "https://habr.com/ru/articles/818819/"
    },
    {
        "id": 7,
        "title": "Не все просто с open source: история развития, облачные инструменты и новые риски",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/2a1/ac3/890/2a1ac3890e55403bf5de8fa77d2bf471.png",
        "body": "Согласно результатам опроса, проведенного компанией «АксТим», в 2026 году 92% российских компаний будут использовать решения на базе open source. Интересно, что в 2021 году оpen source уже использовали все компании-разработчики и 79% компаний-потребителей.\n\r\nУпоминание open source можно было встретить еще в документации и пресс-релизах организаций в 80-х. Сейчас опыт работы с open source интересен всем — от стартапов до облачных провайдеров, которые используют целый каскад знаковых инструментов.\n\r\nНо с опенсорсом не все так просто. Разработчики, продакты и руководители далеко не всегда понимают, что будет, если «база», на которой построен их проект, перейдет в разряд проприетарного ПО или вообще прекратит существование.\n\r\nСегодня подробнее обсудим историю открытого программного обеспечения — от момента зарождения до современных облачных инструментов и новых вызовов.",
        "link": "https://habr.com/ru/companies/mws/articles/818389/"
    },
    {
        "id": 8,
        "title": "Два года ждали: новый релиз «FreeBSD для Mac» — операционной системы ravynOS",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/d7f/579/5b9/d7f5795b9c1d6e2f6db821dca3b5b87a.jpg",
        "body": "Кто-то слышал об этом проекте, кто-то нет, но это весьма интересная разработка. Команда ravynOS создаёт операционную систему на базе FreeBSD, стараясь обеспечить совместимость проекта с приложениями для macOS. Оболочка при этом также имеет очень сильную схожесть с интерфейсом macOS. Наработки проекта распространяются под лицензией BSD. Оценить ОС можно, установив загрузочный образ ravynOS 0.5 — он доступен здесь. Подробности — под катом.",
        "link": "https://habr.com/ru/companies/ru_mts/articles/818255/"
    },
    {
        "id": 9,
        "title": "Kubernetes. Логика работы клиентов с kube-api: что под капотом?",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/7b3/a08/57c/7b3a0857c35baf32a9935fd82d6b653a.png",
        "body": "Привет, Хабр! На связи представитель блока поддержки платформы в Factory5. Обучая своих падаванов устройству kubernetes, я трачу много времени на то, чтобы объяснить, что это не «черная коробка», которая «хранит ямлы» и каким-то образом переваривает это в запущенные приложения, которые «сами себя чинят», а просто удачный набор компонентов, который обеспечивает централизованное управление ресурсами. Главное здесь — именно ресурсы. Экземпляры объектов групп аpi, которые декларативно описывают некоторое состояние инфраструктуры, к которому будут стремиться контроллеры, отвечающие за конкретные группы аpi. И сердцем всего этого является компонент kube-apiserver. По сути своей api-gateway является центральной точкой общения всех компонентов кластера.В этой статье попробую описать логику работы клиентов с kube-api и варианты того, как мы можем этим воспользоваться.",
        "link": "https://habr.com/ru/companies/factory5/articles/818141/"
    },
    {
        "id": 10,
        "title": "Нагружать может каждый",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/e0f/7b0/b4c/e0f7b0b4c1f6885ec0b77fdae9241a3b.jpg",
        "body": "Как понять, что нам нужно нагрузочное тестирование? Как быть, если при этом у нас мало опыта и ресурсов? Сегодня обсудим, насколько трудоёмок этот процесс, как не получить гору проблем и не сжечь больше ресурсов, чем хочется.Меня зовут Ксения Бирюкова, я владелец продукта Платформы Сфера, разработанной холдингом Т1. В одном из моих проектов мы с командой пытались проводить нагрузочное тестирование. Тогда это казалось очень сложным: пробовали тестировать каждый модуль отдельно, связь с legacy-монолитом не помогала, возникали проблемы с написанием генератора псевдо-уникальных персональных данных и многое другое. И хотя результат был достигнут, ресурсов мы потратили гораздо больше, чем планировали. В итоге собрали список ошибок и задумались, как сделать нагрузочное тестирование менее болезненным. Разберём на своих и чужих примерах.",
        "link": "https://habr.com/ru/companies/oleg-bunin/articles/817591/"
    },
    {
        "id": 11,
        "title": "В облако на работу: Архивирование postgres. Дайте два",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/8f1/660/7a6/8f16607a6df752cccb28cf4015c8a079.png",
        "body": "В прошлых публикациях мы, не торопясь, после настройки персонального рабочего места на РедОС 7.3, посмотрели РедОС 8 и почти полностью собрали рабочую сеть 1С на отечественной ОС подходящую для работы среднего размера компании. С веб-серверами, доменной авторизацией и прочая прочая… Осталось настроить регулярное архивирование, чтобы не потерять нажитое. Тех, кто заинтересовался, прошу под кат…",
        "link": "https://habr.com/ru/companies/serverspace/articles/817301/"
    },
    {
        "id": 12,
        "title": "Знания как код: архитектурный репозиторий в git на базе PlantUML",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/122/fef/250/122fef2501effc7c55f2861dcba51441.png",
        "body": "Привет, Хабр! Меня зовут Максим Приходский, я архитектор R-Style Softlab и сегодня хочу рассказать вам о проекте создания архитектурного репозитория в git на базе PlantUML.",
        "link": "https://habr.com/ru/companies/rshb/articles/816199/"
    },
    {
        "id": 13,
        "title": "VFX Система в одном шейдере",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/49c/d75/c0c/49cd75c0cc4902e07cbf3d5347769b2a.jpg",
        "body": "Кастомная VFX система для юнити обходящая по производительности стандартную ParticleSystem в идеальных для неё условиях на 11%, используя возможности графического процессора для всех вычислений и рендеринга. Она разработана для платформ Android и iOS и предлагает значительные преимущества в производительности и возможности к широкой кастомизации. Однако она имеет ограничения, которые необходимо учитывать в некоторых случаях использования.",
        "link": "https://habr.com/ru/articles/815451/"
    },
    {
        "id": 14,
        "title": "Настройка аутентификации по протоколу WebAuthn в OpenAM",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/68d/950/dfe/68d950dfea2e7881d96a15178663f9e7.png",
        "body": "WebAuthn - протокол, разработанный консорциумом W3C и FIDO Alliance для аутентификации без паролей. Используя WebAuthn, можно аутентифицироваться, используя биометрию мобильного телефона или ноутбука. Можно так же использовать аутентификацию при помощи аппаратных USB токенов.  В данной статье мы настроим вход по протоколу WebAuthn в системе управления аутентификацией с открытым исходным кодом - OpenAM",
        "link": "https://habr.com/ru/articles/816475/"
    },
    {
        "id": 15,
        "title": "Вы неправильно настраиваете Emacs",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/cc8/392/f25/cc8392f2540e5e1e3967f3f4c8e9a31b.png",
        "body": "Я давно пользуюсь Emacs, и уж поверьте мне на слово, знаю в нём толк. Однако, каждый день я вижу одни и те же типовые ошибки в init.el. И что самое главное, они из  года в год кочуют из одного init.el в другой, от профессионалов к новичкам.В этой статье я разберу две самых часто встречающихся ошибки в настройке Emacs.",
        "link": "https://habr.com/ru/articles/816159/"
    },
    {
        "id": 16,
        "title": "Безумные вещи, которые я делал как аналитик, или Как я катался на погрузчике и перебирал капусту в магазине",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/ea0/e58/db7/ea0e58db7fff6351f366a7965955e224.png",
        "body": "Недавно оглянулся назад и понял, что у меня накопилось очень много ярких и веселых ситуаций на работе, которые я почему-то ещё не рассказал, и хочу сделать это сейчас! Как говорится: «И я стрелял, и в меня стреляли».Одно из моих прошлых мест работы — компания ритейлер продуктов со своей цепочкой поставок. Данная ниша имеет свою специфику для IT сотрудников, а именно — частые выезды на объекты, будь то магазины или склады. То есть одна из главных точек роста — выезжать на объекты и собирать требования, процессы, находить моменты, которые можно и нужно улучшить. Вот про трудовые будни в ритейле и цепочке поставок я сейчас и расскажу.",
        "link": "https://habr.com/ru/companies/alfa/articles/815605/"
    },
    {
        "id": 17,
        "title": "Когда целый день программировал на Zig: впечатления Rust-энтузиаста",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/786/cf2/898/786cf2898e777aa651425b97c63dda03.png",
        "body": "Я — большой фанат Rust, так как в этом языке предоставляется отличное инструментальное оснащение, и, когда я пишу на этом языке, я могу быть вполне уверен, что этот код будет работать надёжно. Но иногда Rust ненавистен. Чтобы написать код на Rust, требуется немало времени, а некоторые вещи реализовать достаточно сложно (да, async, это я о тебе).\n\r\nВ прошлом году мне не раз доводилось слышать о новом низкоуровневом языке программирования, он называется Zig. И вот, наконец, я нашёл время, чтобы опробовать его на практике. В этой статье я хочу рассказать, что мне понравилось и не понравилось Zig (который я рассматривал с точки зрения Rust-программиста и тех высоких стандартов, к которым я привык в Rust).",
        "link": "https://habr.com/ru/companies/piter/articles/814831/"
    },
    {
        "id": 18,
        "title": "Коммивояжер на GPU",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/25e/ec8/990/25eec89906628e3505b41dca06071ba3.jpg",
        "body": "Мы уже решали задачу коммивояжёра точно методом динамического программирования. С тех пор прошло немало времени. Мне бы хотелось поделиться некоторыми соображениями по улучшению алгоритма, а также представить алгоритм пригодный для расчёта задачи коммивояжера на GPU.Динамическое программирование — это метод решения сложных задач путём разбиения их на более мелкие подзадачи, решение которых легче и проще.Основная идея метода заключается в том, чтобы не решать одну и ту же подзадачу многократно, а сохранять результаты решения подзадач и повторно использовать их для ускорения общего процесса решения.",
        "link": "https://habr.com/ru/articles/814465/"
    },
    {
        "id": 19,
        "title": "«А давайте дампить трафик с сети, а не с хоста». Open Source решение на базе PcapNG",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/745/591/ddf/745591ddfb0a19ef5f88ec0e56afcdf8.jpg",
        "body": "Привет, Хабр! Меня зовут Николай и уже 17 лет я работаю сетевым инженером. Обычный вопрос для моей профессии: «Доходит ли трафик куда нужно?». И десятки лет на него отвечают одним словом — tcpdump.  А теперь зададим другой вопрос: «Как поймать трафик, если доступных путей много? Неужели вариант один: открывать десятки консолей?» В СберМаркете я работаю с начала 2022 года и занимаюсь автоматизацией рабочих процессов. Одной из моих задач и стало найти решение на вопросы, рассмотренные выше. В этой статье я хочу поделиться разработанным нами быстрым решением для получения дампа трафика с множества серверов в одном окошке. Мы уже выкатили его в опенсорс: забрать его можно по ссылке.  В статье же подробно расскажу, как и зачем этим решением пользоваться.",
        "link": "https://habr.com/ru/companies/sbermarket/articles/812941/"
    },
    {
        "id": 20,
        "title": "DivKit теперь и для Flutter. Рассказываем об особенностях BDUI-фреймворка Яндекса",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/1b0/5c3/a70/1b05c3a700517076202286db05e5ba78.png",
        "body": "Полтора года назад мы выпустили в опенсорс DivKit — фреймворк для отрисовки интерфейсов из ответа сервера. На тот момент он уже прошёл проверку временем внутри компании и применялся в приложении Яндекс, Алисе, Маркете, Едадиле и других сервисах. С тех пор инструмент прошёл длинный путь. И сегодня у нас по-настоящему важная новость: мы выпускаем в свободный доступ долгожданный клиент для Flutter.В статье расскажем об особенностях вёрстки в DivKit и нашей реализации UI. Вы узнаете, какие фичи и компоненты Flutter поддерживаются во фреймворке на текущий момент. Покажем, как начать пользоваться клиентом уже сейчас.",
        "link": "https://habr.com/ru/companies/yandex/articles/814187/"
    },
    {
        "id": 21,
        "title": "Дайджест научпоп-новостей за неделю, о которых мы ничего не писали",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/ebe/201/ded/ebe201dedb95821ef83f775b96b0daee.jpg",
        "body": "Воздушные батареи на морском дне предлагают более дешёвые долгосрочные накопители энергииАвстралийские инженеры разработали ультразвуковую кофеварку для холодного завариванияУчёные создали улиток-роботов, которые могут передвигаться самостоятельно с помощью гусениц или работать вместе, чтобы подниматьсяВ наблюдениях «Уэбба» содержится намёк на возможное наличие атмосферы у скалистой экзопланетыАстрономы открыли 27 500 новых астероидов, спрятавшихся на архивных снимках",
        "link": "https://habr.com/ru/articles/814351/"
    },
    {
        "id": 22,
        "title": "Второе рождение DSP или запуск нейросетей на процессорах К1967ВН044 от «Миландр»",
        "image_link": "https://habrastorage.org/r/w780/getpro/habr/upload_files/8b4/869/fb8/8b4869fb8d9a73c7c5ac9d1a4b1d3ac7.jpeg",
        "body": "Нейросети постепенно и незаметно проникают во все уголки нашей жизни. От огромных сеток, которые могут обыгрывать в шахматы чемпионов мира или вести беседу на уровне интеллигентного человека, до совсем маленьких, реагирующих на голосовые команды или выделяющих лица на фотографии.\n\r\nИ если для первых логично использовать специализированную аппаратуру, то вторые вполне могут работать на обычных микроконтроллерах.\n\r\nВ этой статье поделюсь нашим опытом запуска нейросетей на DSP процессоре фирмы «Миландр» К1967ВН044, тем более что в новой ревизии появился Ethernet и можно организовать быстрый обмен данными, например, с ПК.",
        "link": "https://habr.com/ru/articles/811055/"
    },
    {
        "id": 23,
        "title": "Типизированные массивы должны умереть",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/768/ee0/b8d/768ee0b8d5c1921342dddcdebced5d25.png",
        "body": "Хаха :). Не, я серьезно. Позвольте мне объяснить. Хорошо. Что такое типизированный массив?Это одна из тех языковых причуд, которые делают VBA таким... я бы сказал, восхитительным.",
        "link": "https://habr.com/ru/articles/813709/"
    },
    {
        "id": 24,
        "title": "Шахматы. От начала до читов",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/ed9/0e8/0bd/ed90e80bdbf970bc1101a4ac66e3221a.png",
        "body": "Как-то пару лет назад youtube начал мне подсовывать шахматные видео. Смотрел их, и спустя какое-то время начал играть. Сначала против компа на телефоне, затем на lichess. В какой-то прекрасный вечер мне надоело проигрывать и задался вопросом как бы не проигрывать или после отыгрываться. В итоге игра превратилась в написание чита.",
        "link": "https://habr.com/ru/articles/809021/"
    },
    {
        "id": 25,
        "title": "VRackDB — Просто и со вкусом",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/a75/366/8f1/a753668f13599a11bc30bcc537bf22af.png",
        "body": "VRackDB - это простая In Memory Graphite like база данных, предназначенная для хранения временных рядов (графиков). (TypeScript)Мне, как автору базы, хотелось бы немного рассказать о ее особенностях и области применения. Покажу немного картинок, немного кода, возможно даже, немного полезной для вас информации. В общем все как обычно.",
        "link": "https://habr.com/ru/articles/813049/"
    },
    {
        "id": 26,
        "title": "Сбор покрытия Flask (Python) в Runtime",
        "image_link": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/7db/b4e/22e/7dbb4e22ee47c8febc389ee0d89e42a3.png",
        "body": "Всем привет, меня зовут Осипов Станислав. Я занимаюсь AppSec/DevOps с 2021 года. В этой статье я хочу рассказать как можно собрать покрытие Python приложения в runtime (незавершая процесс).Что было использовано для сбора покрытия:https://github.com/pallets/flask - Flask 3.03https://github.com/nedbat/coveragepy - coverage 7.5.1",
        "link": "https://habr.com/ru/articles/812861/"
    }
]